ProgessBase/InformationRegisters/ДС_ГрафикПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДС_ГрафикПлатежей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлатежаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CurrentBalanceOpening</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FinanceCost</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LeasePaymentProvided</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CurrentBalanceClosing</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлатежаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДС_ВидыПлатежейМСФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/ДС_ГрафикПлатежей/Ext/RecordSetModule.bsl
// is Зайцева 20140702 
Процедура ПриЗаписи(Отказ, Замещение)
	          
	Если ДополнительныеСвойства.Свойство("Договор") Тогда
		
		лДоговор = ДополнительныеСвойства.Договор;
		
		лЗапрос = Новый Запрос;
		лЗапрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДС_ГрафикПлатежей.Договор,
			|	СУММА(ДС_ГрафикПлатежей.LeasePaymentProvided) КАК LeasePaymentProvided
			|ИЗ
			|	РегистрСведений.ДС_ГрафикПлатежей КАК ДС_ГрафикПлатежей
			|ГДЕ
			|	ДС_ГрафикПлатежей.Договор = &Договор
			|
			|СГРУППИРОВАТЬ ПО
			|	ДС_ГрафикПлатежей.Договор";
			
		лЗапрос.УстановитьПараметр("Договор", лДоговор);
		лТЗ = лЗапрос.Выполнить().Выгрузить();
		лТЗ.Свернуть(, "LeasePaymentProvided");
		
		лДоговорОбъект = лДоговор.ПолучитьОбъект();
		Если лДоговорОбъект <> Неопределено и лТЗ.Количество() Тогда 
			Если лДоговорОбъект.ис_СуммаВсехЛизинговыхПлатежей = лТЗ[0].LeasePaymentProvided Тогда
			Иначе
				/// Кунов О.В., 10.11.2014 - 
				Если ДополнительныеСвойства.Свойство("ЗагружаетсяИзОбработки") Тогда
					Ответ = Истина;
				Иначе
					Ответ = (Вопрос("Изменить сумму договора в соответствии с рассчитанным графиком?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да);
				КонецЕсли;
				
				Если Ответ Тогда 
				///
					лДоговорОбъект.ис_СуммаВсехЛизинговыхПлатежей = лТЗ[0].LeasePaymentProvided;
					лДоговорОбъект.Записать();
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
